results/lgtm/max-load/k6queries.txt
default   [  35% ] 1 VUs  0h41m46.0s/2h0m0s
     ✗ PromQL status 200
      ↳  12% — ✓ 5 / ✗ 36
     ✓ LogQL status 200
     ✗ Trace status 200
      ↳  0% — ✓ 0 / ✗ 40

     checks.........................: 37.19% ✓ 45                   ✗ 76
     data_received..................: 1.2 MB 482 B/s
     data_sent......................: 10 kB  4.1237456133532335 B/s
     http_req_blocked...............: avg=76.37µs     min=0s      med=0s        max=2.49ms       p(90)=7.96µs     p(95)=9.1µs
     http_req_connecting............: avg=13.66µs     min=0s      med=0s        max=463.02µs     p(90)=0s         p(95)=0s
     http_req_duration..............: avg=841.63ms    min=0s      med=0s        max=1m0s         p(90)=28.76ms    p(95)=110.17ms
       { expected_response:true }...: avg=601.89ms    min=7.34ms  med=15.19ms   max=19.44s       p(90)=80.17ms    p(95)=1.23s
   ✗ http_req_failed................: 62.80% ✓ 76                   ✗ 45
     http_req_receiving.............: avg=109.81µs    min=0s      med=0s        max=1.22ms       p(90)=332.76µs   p(95)=481.14µs
     http_req_sending...............: avg=15.99µs     min=0s      med=0s        max=111.22µs     p(90)=43.92µs    p(95)=47.27µs
     http_req_tls_handshaking.......: avg=0s          min=0s      med=0s        max=0s           p(90)=0s         p(95)=0s
     http_req_waiting...............: avg=841.5ms     min=0s      med=0s        max=1m0s         p(90)=28.25ms    p(95)=110.02ms
     http_reqs......................: 121    0.048266/s
     iteration_duration.............: avg=1m2s        min=1m0s    med=1m0s      max=2m0s         p(90)=1m1s       p(95)=1m15s
     iterations.....................: 40     0.015956/s
   ✓ logql_query_duration_ms........: avg=16.954462   min=7.34904 med=14.309699 max=35.181368    p(90)=29.020694  p(95)=31.454823
     promql_errors..................: 36     0.01436/s
   ✗ promql_query_duration_ms.......: avg=2107.509184 min=0       med=0         max=60000.886465 p(90)=491.404147 p(95)=4945.931703
     trace_errors...................: 40     0.015956/s
   ✓ trace_query_duration_ms........: avg=368.793271  min=0       med=0         max=14751.730832 p(90)=0          p(95)=0
     vus............................: 1      min=1                  max=1
     vus_max........................: 1      min=1                  max=1